# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterMap..::..ForwardIterator Method
ParameterMap Class See Also
---
Retrieve a forward moving iterator to the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ParameterMapIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As ParameterMapIterator
```

Visual C++
---
```text
public:
virtual ParameterMapIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the map.
# See Also
ParameterMap Class
Autodesk.Revit.DB Namespace